-- MySQL dump 10.13  Distrib 8.0.20, for Win64 (x86_64)
--
-- Host: 192.168.99.100    Database: bookstore
-- ------------------------------------------------------
-- Server version	5.7.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `book`
--

DROP TABLE IF EXISTS `book`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `book` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(45) CHARACTER SET utf8mb4 NOT NULL,
  `author_id` int(10) unsigned NOT NULL,
  `genre_id` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES (1,'Война и мир',1,6),(2,'1984',2,3),(3,'Улисс',3,3),(4,'Лолита',4,4),(5,'Звук и ярость',5,4),(6,'Человек-невидимка',6,5),(7,'На маяк',7,5),(8,'Одиссея',8,2),(9,'Гордость и предубеждение',9,2),(10,'Божественная комедия',10,1),(11,'Кентерберийские истории',11,6),(12,'Приключение Гулливера',12,3),(13,'Мидлмарч',13,5),(14,'Распад',14,2),(15,'Над пропастью во ржи',15,4),(16,'Унесенные ветром',16,3),(17,'Сто лет одиночества',17,1),(18,'Великий Гетсби',18,6),(19,'Уловка 22',19,5),(20,'Возлюбленная',20,2),(21,'Гроздья гнева',21,6),(22,'Полночные дети',22,5),(23,'О дивный новый мир',23,3),(24,'Миссис Дэллоуэй',24,5),(25,'Родной сын',25,4),(26,'Демократия в Америке',26,4),(27,'Происхождение видов',27,2),(28,'История',28,4),(29,'Социальный контакт',29,5),(30,'Капитал',30,3),(31,'Государь',31,2),(32,'Признание',32,2),(33,'Левиафан',33,1),(34,'История Пелопонесской войны',34,1),(35,'Властелин колец',35,5),(36,'Винни-Пух',36,1),(37,'Лев, ведьма и платяной шкаф',37,6),(38,'Путешествие в Индию',38,4),(39,'В дороге',39,2),(40,'Убить пересмешника',40,5),(41,'Заводной Апельсин',41,2),(42,'Свет в августе',42,2),(43,'Души черного народа',43,5),(44,'Широкое Саргассово море',44,5),(45,'Госпожа Бовари',45,3),(46,'Потерянный рай',46,4),(47,'Анна Каренина',47,5),(48,'Гамлет',48,4),(49,'Король Лир',49,1),(50,'Отелло',50,5),(51,'Сонеты',51,5),(52,'Листья травы',52,3),(53,'Приключения Гекльберри Финна',53,4),(54,'Ким',54,4),(55,'Франкенштейн',55,2),(56,'Песня Соломона',56,2),(57,'Пролетая над гнездом кукушки',57,3),(58,'По ком звонит колокол',58,4),(59,'Бойня номер пять',59,3),(60,'Скотный двор',60,3),(61,'Повелитель мух',61,2),(62,'Хладнокровное убийство',62,2),(63,'Золотая тетрадь',63,3),(64,'В поисках утраченного времени',64,2),(65,'Вечный сон',65,1),(66,'Когда я умирала',66,3),(67,'Фиеста',67,2),(68,'Я, Клавдий',68,5),(69,'Сердце — одинокий охотник',69,2),(70,'Сыновья и любовники',70,5),(71,'Вся королевская рать',71,2),(72,'Иди, вещай с горы',72,4),(73,'Паутина Шарлотты',73,2),(74,'Сердце тьмы',74,2),(75,'Ночь',75,3),(76,'Кролик, беги',76,3),(77,'Эпоха невинности',77,1),(78,'Случай Портного',78,5),(79,'Американская трагедия',79,4),(80,'День саранчи',80,2),(81,'Тропик Рака',81,1),(82,'Мальтийский сокол',82,4),(83,'Темные начала',83,4),(84,'Смерть приходит за архиепископом',84,2),(85,'Толкование сновидений',85,3),(86,'Воспитание Генри Адамса',86,2),(87,'Красная книжечка',87,6),(88,'Многообразие религиозного опыта',88,1),(89,'Пригоршня праха',89,4),(90,'Безмолвная весна',90,6),(91,'Общая теория занятости, процента и денег',91,5),(92,'Лорд Джим',92,5),(93,'Со всем этим покончено',93,6),(94,'Общество изобилия',94,1),(95,'Ветер в ивах',95,4),(96,'Автобиография Малкольма Икс',96,6),(97,'Знаменитые викторианцы',97,5),(98,'Цвет пурпурный',98,6),(99,'Вторая мировая война в 6-ти томах',99,3);
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-18 20:30:46
