-- MySQL dump 10.13  Distrib 8.0.20, for Win64 (x86_64)
--
-- Host: 192.168.99.100    Database: bookstore
-- ------------------------------------------------------
-- Server version	5.7.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `author`
--

DROP TABLE IF EXISTS `author`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `author` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `author`
--

LOCK TABLES `author` WRITE;
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
INSERT INTO `author` VALUES (1,'Лев Толстой '),(2,'Дж.Оруэлл '),(3,'Дж.Джойс '),(4,'Владимир Набоков '),(5,'Уильям Фолкнер '),(6,'Ральф Эллисон '),(7,'Вирджиниа Вульф '),(8,'Гомер'),(9,'Джейн Остен '),(10,'Данте '),(11,'Чосер '),(12,'Дж. Свифт '),(13,'Джордж Элиот '),(14,'Чинуа Ачебе'),(15,'Дж. Селлинджер '),(16,'Маргарет Митчелл '),(17,'Габриель Гарсиа Маркес '),(18,'Скотт Фиттцжеральд '),(19,'Джозеф Хеллер '),(20,'Тони Моррисон '),(21,'Дж.Стейнбек '),(22,'Салман Рушди '),(23,'Олдос Хаксли '),(24,'Вирджиния Вульф '),(25,'Ричард Райт '),(26,'Алексис Де Токвиль '),(27,'Чарльз Дарвин '),(28,'Геродот '),(29,'Ж-Ж.Руссо '),(30,'Карл Маркс '),(31,'Николо Макиавелли '),(32,'Св. Августин '),(33,'Томас Гоббс '),(34,'Фукидид, '),(35,'Дж.Толкиен '),(36,'Александер Милн '),(37,'Льюис '),(38,'Форстер '),(39,'Джек Керуак '),(40,'Харпер Ли '),(41,'Святая Библия'),(42,'Энтони Берджес '),(43,'Уильям Фолкнер '),(44,'Уильям Дюбуа '),(45,'Джин Рис '),(46,'Густав Флобер '),(47,'Джон Мильтон '),(48,'Лев Толстой '),(49,'Уильям Шекспир '),(50,'Уильям Шекспир '),(51,'Уильям Шекспир '),(52,'Уильям Шекспир '),(53,'Уолт Уитмен '),(54,'Марк Твен '),(55,'Редьярд Киплинг '),(56,'Мери Шелли '),(57,'Тони Моррисон '),(58,'Кен Кизи '),(59,'Эрнест Хемингуэй '),(60,'Курт Воннегут '),(61,'Оруэлл '),(62,'Уильям Голдинг '),(63,'Трумен Капоте '),(64,'Дорис Лессинг '),(65,'Марсель Пруст '),(66,'Реймонд Чандлер '),(67,'Уильям Фолкнер '),(68,'Эрнест Хемингуэй '),(69,'Роберт Грейвс '),(70,'Карсон Маккаллерс '),(71,'Дэвид Лоуренс '),(72,'Роберт Пенн Уоррен '),(73,'Дж. Болдуин '),(74,'Э. Уайт '),(75,'Джозеф Конрад '),(76,'Эли Визель '),(77,'Дж.Апдайк '),(78,'Эдит Уортон '),(79,'Филипп Рот '),(80,'Теодор Драйзер '),(81,'Натанаэл Уэст '),(82,'Генри Миллер '),(83,'Дешил Хэммет '),(84,'Филипп Пулман '),(85,'Уилла Кэсер '),(86,'Зигмунд Фрейд '),(87,'Генри Адамс '),(88,'Мао Цзэдун '),(89,'Уильям Джеймс '),(90,'Ивлин Во '),(91,'Рэйчел Карсон '),(92,'Джон Мейнард Кейнс '),(93,'Джозеф Конрад '),(94,'Роберт Грейвс '),(95,'Джон Кеннет Гелбрейт '),(96,'Кеннет Грэм '),(97,'Алекс Хейли и Малкольм Икс'),(98,'Литтон Стрейчи'),(99,'Элис Уокер'),(100,'Уинстон Черчилль ');
/*!40000 ALTER TABLE `author` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-18 20:30:46
